app/controllers/photos_controller.rb

INSERT INTO "photos" ("created_at", "file", "lattitute", "longitude", "photo_type", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @photo = Photo.new(permitted_params[:photo])
    if @photo.valid?
     @photo.save

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "photos" SET "file" = ?, "updated_at" = ? WHERE "photos"."id" = 1  [["file", "_________________2014-06-01_15_03_01.png"], ["updated_at", Wed, 04 Jun 2014 10:38:38 UTC +00:00]]
---
  def update
    @photo = Photo.find(params[:id])
    if @photo.update_attributes(permitted_params[:photo])