app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(permitted_params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "123"], ["updated_at", Sun, 08 Jun 2014 08:40:20 UTC +00:00]]